Revit 2024 API
NestedFamilyTypeReference.FamilyName Property
 Name of the referenced family
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string FamilyName { get; }
Visual Basic
Public ReadOnly Property FamilyName As String
	Get
Visual C++
public:
property String^ FamilyName {
	String^ get ();
}
See Also
NestedFamilyTypeReference Class
Autodesk.Revit.DB Namespace